import 'package:places/domain/sight.dart';

///Моковые данные интересных мест.
final List mocks = [
  Sight(
    nameSights: 'Памятник Белому Биму',
    lat: '51°39′58″ с. ш.',
    lon: '39°12′20″ в. д.',
    url:
        'https://top10.travel/wp-content/uploads/2017/07/pamyatnik-belomu-bimu.jpg',
    details:
        'Один из неофициальных символов города, созданный скульпторами И. Дикуновым и Э. Пак по мотивам одноименного произведения. Интересно, что мастера изготавливали его исключительно на свои средства. Изваяние представляет собой фигуру собаки, сидящую прямо на брусчатке и терпеливо ожидающую возвращения своего хозяина. Памятник установили в 1998 году на проспекте Революции около театра кукол «Шут».',
  ),
  Sight(
    nameSights: 'Котёнок с улицы Лизюкова',
    lat: '51°42′24″ с. ш.',
    lon: '39°10′20″ в. д.',
    url:
        'https://top10.travel/wp-content/uploads/2017/07/kotyonok-s-ulicy-lizyukova.jpg',
    details:
        'Памятник, увековечивший еще одного популярного героя – котенка из советского мультфильма, который, согласно сюжету, был обитателем Воронежа. Скульптуру создали И. Дикунов и Э. Пак в 2003 году. Автором идеи выступила ученица 11 класса, победившая на конкурсе лучших проектов. Фигура животного восседает на ветке дерева. Кажется, что котенок всецело занят беседой с любопытной вороной.',
  ),
  Sight(
    nameSights: 'Корабль-музей «Гото-Предестинация»',
    lat: '51°39′21″ с. ш.',
    lon: '39°12′58″ в. д.',
    url:
        'https://top10.travel/wp-content/uploads/2017/07/goto-predestinaciya.jpg',
    details:
        'Копия реального судна времен Петра I, стоящая у Адмиралтейской площади. Идея создать корабль-музей пришла в голову воронежским властям в 2009 году. Сначала предполагалось, что над ним будут работать специалисты из Дании, но в итоге конструкцию возвели российские мастера. Музей был торжественно открыт в 2014 году в День ВМФ. Его экспозиция состоит из предметов, повествующих о зарождении и развитии морского флота.',
  )
];
